Revit 2027 API
Subelement.GetReference Method
 Obtains the reference to this subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetReference()
Public Function GetReference As Reference
public:
Reference^ GetReference()
member GetReference : unit -> Reference
Return Value
Reference
 The reference to this subelement.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace